cmsis-svd/cmsis-svd/data/Microchip/ATSAM4CMx32C_0.svd
        <register>
          <name>CMR1</name>
          <description>PWM Channel Mode Register (ch_num = 1)</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRE</name>
              <description>Channel Pre-scaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Master Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV2</name>
                  <description>Master Clock divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV4</name>
                  <description>Master Clock divided by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV8</name>
                  <description>Master Clock divided by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV16</name>
                  <description>Master Clock divided by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV32</name>
                  <description>Master Clock divided by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV64</name>
                  <description>Master Clock divided by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV128</name>
                  <description>Master Clock divided by 128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV256</name>
                  <description>Master Clock divided by 256</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV512</name>
                  <description>Master Clock divided by 512</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV1024</name>
                  <description>Master Clock divided by 1024</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKA</name>
                  <description>Clock A</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKB</name>
                  <description>Clock B</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALG</name>
              <description>Channel Alignment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Channel Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPD</name>
              <description>Channel Update Period</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTY1</name>
          <description>PWM Channel Duty Cycle Register (ch_num = 1)</description>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDTY</name>
              <description>Channel Duty Cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRD1</name>
          <description>PWM Channel Period Register (ch_num = 1)</description>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRD</name>
              <description>Channel Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT1</name>
          <description>PWM Channel Counter Register (ch_num = 1)</description>
          <addressOffset>0x0000022C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Channel Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CUPD1</name>
          <description>PWM Channel Update Register (ch_num = 1)</description>
          <addressOffset>0x00000230</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CUPD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR2</name>
          <description>PWM Channel Mode Register (ch_num = 2)</description>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRE</name>
              <description>Channel Pre-scaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Master Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV2</name>
                  <description>Master Clock divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV4</name>
                  <description>Master Clock divided by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV8</name>
                  <description>Master Clock divided by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV16</name>
                  <description>Master Clock divided by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV32</name>
                  <description>Master Clock divided by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV64</name>
                  <description>Master Clock divided by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV128</name>
                  <description>Master Clock divided by 128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV256</name>
                  <description>Master Clock divided by 256</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV512</name>
                  <description>Master Clock divided by 512</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV1024</name>
                  <description>Master Clock divided by 1024</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKA</name>
                  <description>Clock A</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKB</name>
                  <description>Clock B</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALG</name>
              <description>Channel Alignment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Channel Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPD</name>
              <description>Channel Update Period</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTY2</name>
          <description>PWM Channel Duty Cycle Register (ch_num = 2)</description>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDTY</name>
              <description>Channel Duty Cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRD2</name>
          <description>PWM Channel Period Register (ch_num = 2)</description>
          <addressOffset>0x00000248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRD</name>
              <description>Channel Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT2</name>
          <description>PWM Channel Counter Register (ch_num = 2)</description>
          <addressOffset>0x0000024C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Channel Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CUPD2</name>
          <description>PWM Channel Update Register (ch_num = 2)</description>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CUPD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR3</name>
          <description>PWM Channel Mode Register (ch_num = 3)</description>
          <addressOffset>0x00000260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRE</name>
              <description>Channel Pre-scaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Master Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV2</name>
                  <description>Master Clock divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV4</name>
                  <description>Master Clock divided by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV8</name>
                  <description>Master Clock divided by 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV16</name>
                  <description>Master Clock divided by 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV32</name>
                  <description>Master Clock divided by 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV64</name>
                  <description>Master Clock divided by 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV128</name>
                  <description>Master Clock divided by 128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV256</name>
                  <description>Master Clock divided by 256</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV512</name>
                  <description>Master Clock divided by 512</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV1024</name>
                  <description>Master Clock divided by 1024</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKA</name>
                  <description>Clock A</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKB</name>
                  <description>Clock B</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALG</name>
              <description>Channel Alignment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Channel Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPD</name>
              <description>Channel Update Period</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTY3</name>
          <description>PWM Channel Duty Cycle Register (ch_num = 3)</description>
          <addressOffset>0x00000264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDTY</name>
              <description>Channel Duty Cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRD3</name>
          <description>PWM Channel Period Register (ch_num = 3)</description>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRD</name>
              <description>Channel Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT3</name>
          <description>PWM Channel Counter Register (ch_num = 3)</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Channel Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CUPD3</name>
          <description>PWM Channel Update Register (ch_num = 3)</description>
          <addressOffset>0x00000270</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CUPD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
